NetologySlow/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФактическийАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическийАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
</mdclass:Catalog>

NetologySlow/src/Enums/ЮридическоеФизическоеЛицо/ЮридическоеФизическоеЛицо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЮридическоеФизическоеЛицо</name>
  <enumValues>
    <name>ФизическоеЛицо</name>
  </enumValues>
  <enumValues>
    <name>ЮридическоеЛицо</name>
  </enumValues>
</mdclass:Enum>

NetologySlow/src/Catalogs/Контрагенты/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	УстановитьДоступностьКПП(Объект.Тип, Элементы.КПП);
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Не РаботаСИННКлиентСервер.ИННВерен(Объект.ИНН, Объект.Тип) Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипПриИзменении(Элемент)
	УстановитьДоступностьКПП(Объект.Тип, Элементы.КПП);
КонецПроцедуры

&НаКлиенте
Процедура ИННПриИзменении(Элемент)
	ТекстОшибки = "";
	Если Не РаботаСИННКлиентСервер.ИННВерен(Объект.ИНН, Объект.Тип, ТекстОшибки) Тогда
		Элементы.ИннДекорация.Видимость = Истина;
		Элементы.ИннДекорация.Заголовок = ТекстОшибки;
	Иначе
		Элементы.ИннДекорация.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	Объект.ПолноеНаименование = ПолучитьПолноеНаименование(Объект.Наименование);
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьКПП(ТипКонтрагента, КПП)
	
	Если ТипКонтрагента = ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо") Тогда
		КПП.Видимость = Истина;
	Иначе
		КПП.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьПолноеНаименование(СокращенноеНаименование)
	
	Сокращения = Новый Структура;
	Сокращения.Вставить("АО", "Акционерное общество");
	Сокращения.Вставить("ООО", "Общество с ограниченной ответственностью");
	Сокращения.Вставить("ЗАО", "Закрытое акционерное общество");
	Сокращения.Вставить("ИП", "Индивидуальный предприниматель");
	
	Для Каждого Сокращение Из Сокращения Цикл
		Если СтрНачинаетсяС(СокращенноеНаименование, Сокращение.Ключ) Тогда
			Возврат Сокращение.Значение + Сред(СокращенноеНаименование, СтрДлина(Сокращение.Ключ) + 1);
		КонецЕсли;
	КонецЦикла;
	
	Возврат СокращенноеНаименование;
	
КонецФункции

#КонецОбласти
